## Terraform Plan 📋

## 📊 Plan Analysis Results
| Metric | Count |
|--------|-------|
| 🏗️ Resources Changed | 76 |
| ➕ Create | 5 |
| 🔄 Update | 0 |
| 🗑️ Delete | 2 |
| 🔁 Replace | 1 |


⚠️ **ATTENTION REQUIRED**
🗑️ This plan includes **2** deletion(s) - review carefully

🔁 This plan includes **1** replacement(s) - review carefully



📈 **Large Change Detected**
This plan modifies **76** resources (threshold: 10)

✅ **Plan Analysis Passed** - No critical issues detected


<details>
<summary>Show Full Plan</summary>

```hcl
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.security.data.aws_caller_identity.current: Reading...
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.networking.data.aws_region.current: Reading...
module.networking.module.vpc.data.aws_partition.current[0]: Reading...
module.networking.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks_cluster.aws_iam_role.node_group: Refreshing state... [id=ml-platform-dev-ng-20251109234831515300000003]
module.networking.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0bc0f1b3d869d4a7e]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 625f0d07): Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251109235917169100000014]
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.networking.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.networking.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.networking.module.vpc.data.aws_region.current[0]: Reading...
module.eks_cluster.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/ml-platform-dev/cluster]
module.eks_cluster.module.eks.data.aws_partition.current[0]: Reading...
module.networking.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-west-2]
module.eks_cluster.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.container_registry.aws_ecr_repository.this: Refreshing state... [id=ml-platform-api]
module.networking.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251109234831514000000002]
module.eks_cluster.module.eks.aws_iam_role.this[0]: Refreshing state... [id=ml-platform-dev-cluster-20251109234831512900000001]
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=984479408136]
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.networking.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=984479408136]
module.security.data.aws_caller_identity.current: Read complete after 1s [id=984479408136]
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Read complete after 1s [id=arn:aws:sts::984479408136:assumed-role/GitHubActions-AssumeRoleForActions/GitHubActions-TF-Plan-19238858088]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_cni_policy: Refreshing state... [id=ml-platform-dev-ng-20251109234831515300000003/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks_cluster.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=ml-platform-dev-cluster-20251109234831512900000001/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_worker_node_policy: Refreshing state... [id=ml-platform-dev-ng-20251109234831515300000003/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ec2_container_registry_read_only: Refreshing state... [id=ml-platform-dev-ng-20251109234831515300000003/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ssm_managed_instance_core[0]: Refreshing state... [id=ml-platform-dev-ng-20251109234831515300000003/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.container_registry.aws_ecr_lifecycle_policy.this: Refreshing state... [id=ml-platform-api]
module.networking.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-04c4abccff2449f7f]
module.networking.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-02ab99f737571dc25]
module.networking.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e51079c00abcde29]
module.networking.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-051b745d54aab57a9]
module.networking.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d499d5c977654e28]
module.networking.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-058dc1431ef95abc6]
module.networking.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0bdb37ef9940a0e99]
module.eks_cluster.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0b6291eb591ae62e2]
module.networking.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0df1e4697248c3649]
module.networking.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0bc0f1b3d869d4a7e]
module.networking.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01a0a67d7af63e9c3]
module.networking.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04b042dba5b15d3dd]
module.networking.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0725660086a41cdd6]
module.networking.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-039edcf95c8c76402]
module.networking.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0bfe9d5be65243edf]
module.eks_cluster.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-04464eed4a2edb62a]
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.networking.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-019ddc445893b827b]
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2746461713]
module.networking.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::984479408136:policy/vpc-flow-log-to-cloudwatch-20251109234845621800000009]
module.networking.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0312a95ec67c5598d]
module.networking.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b2880cd80d1f8264]
module.networking.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09c663d8aa5f879ee]
module.networking.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-051b745d54aab57a91080289494]
module.networking.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-016789ff8435ccde6]
module.networking.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251109234831514000000002/arn:aws:iam::984479408136:policy/vpc-flow-log-to-cloudwatch-20251109234845621800000009]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-542544616]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_ntp"]: Refreshing state... [id=sgrule-3542202381]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_kubelet"]: Refreshing state... [id=sgrule-394074273]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3843188895]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-2818148273]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2215194887]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_tcp"]: Refreshing state... [id=sgrule-1142500432]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1319934072]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-3186315972]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_node_ports"]: Refreshing state... [id=sgrule-1210787376]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_udp"]: Refreshing state... [id=sgrule-3132356804]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_to_node_all_traffic"]: Refreshing state... [id=sgrule-543352375]
module.eks_cluster.module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"]: Refreshing state... [id=sgrule-1752656920]
module.eks_cluster.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3405179778]
module.networking.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-00bd3900c9f3ea6b9]
module.networking.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0acb6b7e569046e1b]
module.networking.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e03f31de31136f61]
module.networking.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f54b4c2f0bd54e9a]
module.networking.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0725660086a41cdd61080289494]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0e9f2ad3266aa0407]
module.networking.aws_vpc_endpoint.autoscaling: Refreshing state... [id=vpce-0d6f33a47b317f29f]
module.networking.aws_vpc_endpoint.ec2: Refreshing state... [id=vpce-0fac51ee2575444bb]
module.networking.aws_vpc_endpoint.sts: Refreshing state... [id=vpce-09a0016a3c414489a]
module.networking.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-0ed521e06ba567229]
module.networking.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-04f2280ff1e04391b]
module.eks_cluster.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=ml-platform-dev]
module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-0c111259719936999,Cluster]
module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0c111259719936999,Environment]
module.eks_cluster.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-11-09T23:59:10Z]
module.eks_cluster.module.eks.data.tls_certificate.this[0]: Reading...
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=7663277169175040379]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0]: Refreshing state... [id=lt-0360ddd0721a472b4]
module.eks_cluster.module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=4687b9863b4f2caa907e2ad6c9ffcf73433dc367]
module.eks_cluster.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/6183887E9D57324A6160F8C248235ABC]
module.eks_cluster.data.aws_iam_policy_document.ebs_csi_driver_assume_role[0]: Reading...
module.eks_cluster.data.aws_iam_policy_document.ebs_csi_driver_assume_role[0]: Read complete after 0s [id=3776219339]
module.eks_cluster.aws_iam_role.ebs_csi_driver[0]: Refreshing state... [id=ml-platform-dev-ebs-csi-20251109235841247200000011]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/eks/optimized-ami/1.34/amazon-linux-2023/x86_64/standard/recommended/release_version]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0]: Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251110075939177800000001]
module.eks_cluster.aws_iam_role_policy_attachment.ebs_csi_driver[0]: Refreshing state... [id=ml-platform-dev-ebs-csi-20251109235841247200000011/arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy]
module.eks_cluster.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks_cluster.module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks_cluster.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks_cluster.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks_cluster.module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks_cluster.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks_cluster.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks_cluster.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-west-2:984479408136:nodegroup/ml-platform-dev/ml-platform-dev-ng-20251110075939177800000001/72cd3663-8d7a-fc54-3ce6-0280145de788"
        id                     = "ml-platform-dev:ml-platform-dev-ng-20251110075939177800000001"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-ml-platform-dev-ng-20251110075939177800000001-72cd3663-8d7a-fc54-3ce6-0280145de788"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-ng"
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks_cluster.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.52.1-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + service_account_role_arn    = "arn:aws:iam::984479408136:role/ml-platform-dev-ebs-csi-20251109235841247200000011"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.12.4-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.34.0-eksbuild.4"
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.20.4-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:us-west-2:984479408136:nodegroup/ml-platform-dev/ml-platform-dev-ng-20251110075939177800000001/72cd3663-8d7a-fc54-3ce6-0280145de788" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "ml-platform-dev:ml-platform-dev-ng-20251110075939177800000001" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "ml-platform-dev-ng-20251110075939177800000001" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-ml-platform-dev-ng-20251110075939177800000001-72cd3663-8d7a-fc54-3ce6-0280145de788"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-ng"
        }
        # (11 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0360ddd0721a472b4"
          ~ name    = "main-20251109235911319800000012" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ node_repair_config (known after apply)

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 625f0d07) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2023_x86_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-west-2:984479408136:nodegroup/ml-platform-dev/ml-platform-dev-ng-20251109235917169100000014/76cd3587-a87d-e370-1564-b5f345d121c3" -> null
      - capacity_type          = "ON_DEMAND" -> null
      - cluster_name           = "ml-platform-dev" -> null
      - disk_size              = 0 -> null
      - id                     = "ml-platform-dev:ml-platform-dev-ng-20251109235917169100000014" -> null
      - instance_types         = [
          - "t3.micro",
        ] -> null
      - labels                 = {} -> null
      - node_group_name        = "ml-platform-dev-ng-20251109235917169100000014" -> null
      - node_group_name_prefix = "ml-platform-dev-ng-" -> null
      - node_role_arn          = "arn:aws:iam::984479408136:role/ml-platform-dev-ng-20251109234831515300000003" -> null
      - region                 = "us-west-2" -> null
      - release_version        = "1.34.1-20251103" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-ml-platform-dev-ng-20251109235917169100000014-76cd3587-a87d-e370-1564-b5f345d121c3"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "CREATE_FAILED" -> null
      - subnet_ids             = [
          - "subnet-01a0a67d7af63e9c3",
          - "subnet-04b042dba5b15d3dd",
          - "subnet-0df1e4697248c3649",
        ] -> null
      - tags                   = {
          - "Cluster"     = "ml-platform-dev"
          - "Environment" = "dev"
          - "Name"        = "ml-platform-dev-ng"
        } -> null
      - tags_all               = {
          - "Cluster"     = "ml-platform-dev"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Name"        = "ml-platform-dev-ng"
          - "Owner"       = "wlevan3"
          - "Project"     = "ml-platform-engineering-practicum"
        } -> null
      - version                = "1.34" -> null

      - launch_template {
          - id      = "lt-0360ddd0721a472b4" -> null
          - name    = "main-20251109235911319800000012" -> null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 4 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 0 -> null
          - max_unavailable_percentage = 33 -> null
        }
    }

Plan: 5 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Event**: `pull_request`
**Run**: [#19238858088](https://github.com/wlevan3/ml-platform-engineering-practicum/actions/runs/19238858088)
**Analysis**: `✅ Complete`
